"""
[최종문제] 위 규칙을 가지고 아래 배열을 정렬하시오.

    [
        [6,5,4,5,5,8],
        [6,5,6],
        [6,5,4,5,5],
        [3,4,5,8,9,3,3,3]
        [9],
        [1,4,7]
    ]
    정렬후
    [
        [1,4,7]
        [3,4,5,8,9,3,3,3]
        [6,5,4,5,5],
        [6,5,4,5,5,8],
        [6,5,6],
        [9],
    ]

"""

def printA(a):
    print("---------------")
    for i in range(len(a)):
        print(a[i])
    print("---------------")

a = [
    [0,0,0,1],
    [6, 5, 4, 5],
    [0,0,0],
    [6, 1],
    [6],
    [6, 5],
    [6, 5, 4, 5, 5, 8],
    [6, 5, 6],
    [6, 2, 1],
    [6, 5, 4, 5, 5],
    [6],
    [9],
    [6,-1,6],
    [6, 2, 2],
    [6, 1, 6, 8, 5],
    [9, 6, 3],
    [6, 2, 2, 4],
    [6, 5, 4],
    [6, 6],
    [6, 0, 6],
    [6, 0],
    [6,-1,5],
    [6, 5, 4, 5, 4, 1],
    [3, 1],
    [3],
    [3, 5],
    [3, 5, 4, 5, 5, 8],
    [3, 5, 3],
    [9, 6, 2],
    [3, 2, 1],
    [3, 5, 4, 5, 5],
    [7,1],
    [3],
    [7,1,0],
    [0,1,0],
    [9, 2,-1],
    [3,-1,3],
    [3, 2, 2],
    [3, 1, 6, 8, 5],
    [3, 2, 6, 4],
    [3, 5, 4],
    [3, 6],
    [9, 6, 2],
    [9, 6, 0],
    [3, 0, 6],
    [3, 0],
    [3,-1,5],
    [3, 5, 4, 3, 2, 1],
    [9, 2, 1],
    [9, 2, 0, 2, 3],
    [0,0,0,2],
    [9, 2, 5, 2, 3],
    [1, 5, 4, 2, 5, 8],
    [1, 5, 3],
    [1, 2, 1],
    [6,1],
    [1, 1, 1, 1, 1],
    [1],
    [1,-1,3],
    [1, 2, 2],
]
# print("---------------")
# for i in range(len(a)):
#     print(a[i])
# print("---------------")
for i in range(len(a)):
    index = i
    for j in range(i + 1, len(a)):
        # 짧은거 기준으로 돌아야 에러가 안난다.
        length = 0
        size1 = len(a[i])
        size2 = len(a[j])
        if size1 > size2:
            length = size2
        else:
            length = size1

        count = 0

        # 짧은 배열안에서 각 값들을 비교한다.
        for k in range(length):
            # 작으면 바로 종료한다. 
            if a[i][k] < a[j][k]:
                break
            
            if a[i][k] > a[j][k]:
                temp = a[i]
                a[i] = a[j]
                a[j] = temp
                break
            # 전부 값이 같은지 카운트
            if a[i][k] == a[j][k]:
                count += 1

        # 전부 값이 같으면 길이로 비교한다. 
        if count == length:
            if size1 > size2:
                temp = a[i]
                a[i] = a[j]
                a[j] = temp
        # printA(a)
printA(a)    